Revit 2020 API
ExternalFileUtils Members
The ExternalFileUtils type exposes the following members.
Methods
Name | Description
GetAllExternalFileReferences
 Gets the ids of all elements which are external file references.
GetExternalFileReference
 Gets the external file referencing data for the given element.
IsExternalFileReference
 Determines whether the given element represents an external file.
See Also
ExternalFileUtils Class
Autodesk.Revit.DB Namespace